      ******************************************************************
      * Author: Raphael Frei
      * Date: 15/06/2022
      * Purpose: First Program
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PG01HLLWD.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello World!"
            STOP RUN.
       END PROGRAM PG01HLLWD.
